app/controllers/grams_controller.rb

  def index
    @grams = Gram.all
---
SELECT "grams".* FROM "grams"

  def create
    @gram = current_user.grams.create(gram_params)
---
INSERT INTO "grams" ("message", "created_at", "updated_at", "user_id", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "my new photo!"], ["created_at", "2019-07-06 13:37:39.585010"], ["updated_at", "2019-07-06 13:37:39.585010"], ["user_id", 2], ["picture", "Screen_Shot_2019-07-05_at_7.05.43_PM.png"]]

  def show
    @gram = Gram.find_by_id(params[:id])
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def edit
    @gram = Gram.find_by_id(params[:id])
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    if @gram.user != current_user
    return render plain: 'Forbidden :(', status: :forbidden
  end

    @gram.update_attributes(gram_params)
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "grams" SET "message" = $1, "updated_at" = $2 WHERE "grams"."id" = $3  [["message", "Changed"], ["updated_at", "2019-06-22 18:33:57.676848"], ["id", 35]]

  def destroy
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    return render_not_found(:forbidden) if @gram.user != current_user
    @gram.destroy
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
DELETE FROM "grams" WHERE "grams"."id" = $1  [["id", 57]]